package app

import (
	"cnest_consult/univ/utils"
	"database/sql"
)

func db_recruit_method(db *sql.DB) {
	
	// Drop Table
	stmt, err := db.Prepare(`DROP TABLE IF EXISTS recruit_method;`)
	utils.HandleErr(err, "Drop recruit_method table")
	_, err = stmt.Exec()
	utils.HandleErr(err, "Exec for Drop recruit_method table")

	// Create Table
	stmt, err = db.Prepare(`
		CREATE TABLE IF NOT EXISTS recruit_method (
			id SERIAL PRIMARY KEY,
			recruitId varchar(16) NOT NULL,
			recruitName varchar(16) NOT NULL,
			recruit1st varchar(120),
			recruit1stVol varchar(120),
			recruitFinal varchar(256),
			sort integer,
			flag integer,
			inUser varchar(24),
			inDate TIMESTAMP,
			reUser varchar(24),
			reDate TIMESTAMP );
		`)

	utils.HandleErr(err, "Create recruit_method table")
	_, err = stmt.Exec()
	utils.HandleErr(err, "Exec for Create recruit_method table")

	//  Insert Data
	stmt, err = db.Prepare(`
		INSERT INTO recruit_method (
			id, recruitId, recruitName, recruit1st, recruit1stVol, recruitFinal, sort, flag) VALUES
			(1, 'recu_1001', '단계별', '교과(100)', '10배수', '교과(60) + 면접(40)', 0, 0),
			(2, 'recu_1002', '단계별', '교과(100)', '3배수', '1단계(100) + 체력/ 면접/ 인성 및 신원조사 합·불판정', 0, 0),
			(3, 'recu_1003', '단계별', '교과(100)', '3배수', '1단계(70) + 면접(15) + 체력(15)', 0, 0),
			(4, 'recu_1004', '단계별', '교과(100)', '3배수', '1단계(80) + 체력(10) + 면접(10) + 인성 및 신원조사', 0, 0),
			(5, 'recu_1005', '단계별', '교과(100)', '3배수', '교과(80) + 면접(10) + 체력(10)', 0, 0),
			(6, 'recu_1006', '단계별', '교과(100)', '3배수', '교과(80) + 면접(20)', 0, 0),
			(7, 'recu_1007', '단계별', '교과(100)', '3배수', '서류(70) + 면접(30)', 0, 0),
			(8, 'recu_1008', '단계별', '교과(100)', '5배수', '1단계(60) + 면접(40)', 0, 0),
			(9, 'recu_1009', '단계별', '교과(100)', '5배수', '1단계(70) + 면접(30)', 0, 0),
			(10, 'recu_1010', '단계별', '교과(80) + 출결(10) + 봉사(10)', '5배수', '1단계(60) + 면접(40)', 0, 0),
			(11, 'recu_1011', '단계별', '교과(80) + 출결(20)', '10배수', '1단계(80) + 면접(20)', 0, 0),
			(12, 'recu_1012', '단계별', '교과(80) + 출석(20)', '5배수', '1단계(80) + 면접(20)', 0, 0),
			(13, 'recu_1013', '단계별', '서류(100)', '2.5배수', '1단계(60) + 면접(40)', 0, 0),
			(14, 'recu_1014', '단계별', '서류(100)', '2.5배수', '서류(70) + 면접(30)', 0, 0),
			(15, 'recu_1015', '단계별', '서류(100)', '2.5배수 내외', '서류(60) + 면접(40)', 0, 0),
			(16, 'recu_1016', '단계별', '서류(100)', '2~4배수', '1단계(60) + 면접(40)', 0, 0),
			(17, 'recu_1017', '단계별', '서류(100)', '2배수', '1단계(70) + 면접(30)', 0, 0),
			(18, 'recu_1018', '단계별', '서류(100)', '2배수', '서류(100) + 면접 및 구술고사(100)', 0, 0),
			(19, 'recu_1019', '단계별', '서류(100)', '2배수', '서류(200) + 면접(100)', 0, 0),
			(20, 'recu_1020', '단계별', '서류(100)', '2배수 내외', '서류(60) + 면접(40)', 0, 0),
			(21, 'recu_1021', '단계별', '서류(100)', '3.5배수', '1단계(70) + 면접(30)', 0, 0),
			(22, 'recu_1022', '단계별', '서류(100)', '3배수', '1단계(70) + 면접(30)', 0, 0),
			(23, 'recu_1023', '단계별', '서류(100)', '3배수', '1단계(80) + 면접(20)', 0, 0),
			(24, 'recu_1024', '단계별', '서류(100)', '3배수', '면접(100)', 0, 0),
			(25, 'recu_1025', '단계별', '서류(100)', '3배수', '서류(50) + 면접(50)', 0, 0),
			(26, 'recu_1026', '단계별', '서류(100)', '3배수', '서류(60) + 면접(40)', 0, 0),
			(27, 'recu_1027', '단계별', '서류(100)', '3배수', '서류(70) + 면접(30)', 0, 0),
			(28, 'recu_1028', '단계별', '서류(100)', '3배수 내외', '1단계(70) + 면접(30)', 0, 0),
			(29, 'recu_1029', '단계별', '서류(100)', '3배수 내외', '1단계(80) + 면접(20)', 0, 0),
			(30, 'recu_1030', '단계별', '서류(100)', '3배수 내외', '서류(60) + 면접(40)', 0, 0),
			(31, 'recu_1031', '단계별', '서류(100)', '3배수 내외', '서류(70) + 면접(30)', 0, 0),
			(32, 'recu_1032', '단계별', '서류(100)', '4배수', '1단계(50) + 면접(50)', 0, 0),
			(33, 'recu_1033', '단계별', '서류(100)', '4배수', '1단계(60) + 면접(40)', 0, 0),
			(34, 'recu_1034', '단계별', '서류(100)', '4배수', '1단계(70) + 면접(30)', 0, 0),
			(35, 'recu_1035', '단계별', '서류(100)', '4배수', '1단계(80) + 면접(20)', 0, 0),
			(36, 'recu_1036', '단계별', '서류(100)', '4배수', '서류(40) + 면접(60)', 0, 0),
			(37, 'recu_1037', '단계별', '서류(100)', '4배수', '서류(60) + 면접(40)', 0, 0),
			(38, 'recu_1038', '단계별', '서류(100)', '4배수', '서류(70) + 면접(30)', 0, 0),
			(39, 'recu_1039', '단계별', '서류(100)', '4배수 내외', '서류(70) + 면접(30)', 0, 0),
			(40, 'recu_1040', '단계별', '서류(100)', '5배수', '1단계(60) + 면접(40)', 0, 0),
			(41, 'recu_1041', '단계별', '서류(100)', '5배수', '서류(50) + 면접(50)', 0, 0),
			(42, 'recu_1042', '단계별', '서류(100)', '5배수', '서류(60) + 면접(40)', 0, 0),
			(43, 'recu_1043', '단계별', '서류(100)', '5배수', '서류(70) + 면접(30)', 0, 0),
			(44, 'recu_1044', '단계별', '서류(100)', '5배수 내외', '서류(60) + 면접(40)', 0, 0),
			(45, 'recu_1045', '단계별', '서류(100)', '5배수 이내', '서류(70) + 면접(30)', 0, 0),
			(46, 'recu_1046', '단계별', '서류(100)', '6배수', '서류(70) + 면접(30)', 0, 0),
			(47, 'recu_1047', '단계별', '실적평가(100)', '5배수 내외', '면접(60) + 학생부종합평가(40)', 0, 0),
			(48, 'recu_1048', '단계별', '어학성적(100)', '3배수', '1단계(20) + 교과(30) + 면접(50)', 0, 0),
			(49, 'recu_1049', '단계별', '어학성적(100)', '8배수', '1단계(20) + 교과(30) + 면접(50)', 0, 0),
			(50, 'recu_1050', '단계별', '특기 종합평가(100)', '4배수 내외', '종합평가(100)', 0, 0),
			(51, 'recu_1051', '단계별', '학생부종합평가(100)', '5배수', '1단계(80) + 면접(20)', 0, 0),
			(52, 'recu_1052', '일괄합산', '', '', '교과(100)', 0, 0),
			(53, 'recu_1053', '일괄합산', '', '', '교과(20) + 실기(80)', 0, 0),
			(54, 'recu_1054', '일괄합산', '', '', '교과(30) + 출결(10) + 비교과(60)', 0, 0),
			(55, 'recu_1055', '일괄합산', '', '', '교과(54) + 출결(6) + 면접(40)', 0, 0),
			(56, 'recu_1056', '일괄합산', '', '', '교과(60) + 면접(40)', 0, 0),
			(57, 'recu_1057', '일괄합산', '', '', '교과(60) + 서류(40)', 0, 0),
			(58, 'recu_1058', '일괄합산', '', '', '교과(60) + 실기(40)', 0, 0),
			(59, 'recu_1059', '일괄합산', '', '', '교과(63) + 출석(7) + 면접(30)', 0, 0),
			(60, 'recu_1060', '일괄합산', '', '', '교과(70) + 면접(30)', 0, 0),
			(61, 'recu_1061', '일괄합산', '', '', '교과(70) + 출결 및 봉사(30)', 0, 0),
			(62, 'recu_1062', '일괄합산', '', '', '교과(70) + 출결(30)', 0, 0),
			(63, 'recu_1063', '일괄합산', '', '', '교과(80) + 면접(20)', 0, 0),
			(64, 'recu_1064', '일괄합산', '', '', '교과(80) + 봉사(10) + 출결(10)', 0, 0),
			(65, 'recu_1065', '일괄합산', '', '', '교과(80) + 서류(20)', 0, 0),
			(66, 'recu_1066', '일괄합산', '', '', '교과(80) + 출결봉사(20)', 0, 0),
			(67, 'recu_1067', '일괄합산', '', '', '교과(80) + 출석(20)', 0, 0),
			(68, 'recu_1068', '일괄합산', '', '', '교과(90) + 봉사(10)', 0, 0),
			(69, 'recu_1069', '일괄합산', '', '', '교과(90) + 출결(10)', 0, 0),
			(70, 'recu_1070', '일괄합산', '', '', '교과(90) + 출결(5) + 봉사(5)', 0, 0),
			(71, 'recu_1071', '일괄합산', '', '', '교과(90) + 출결봉사(10)', 0, 0),
			(72, 'recu_1072', '일괄합산', '', '', '교과(90) + 출석(10)', 0, 0),
			(73, 'recu_1073', '일괄합산', '', '', '교과(95) + 출결(5)', 0, 0),
			(74, 'recu_1074', '일괄합산', '', '', '논술(100)', 0, 0),
			(75, 'recu_1075', '일괄합산', '', '', '논술(60) + 교과(20) + 출결 및 봉사(20)', 0, 0),
			(76, 'recu_1076', '일괄합산', '', '', '논술(60) + 교과(40)', 0, 0),
			(77, 'recu_1077', '일괄합산', '', '', '논술(70) + 교과(20) + 출결(10)', 0, 0),
			(78, 'recu_1078', '일괄합산', '', '', '논술(70) + 교과(21) + 출결봉사(9)', 0, 0),
			(79, 'recu_1079', '일괄합산', '', '', '논술(70) + 교과(27) + 출결봉사(3)', 0, 0),
			(80, 'recu_1080', '일괄합산', '', '', '논술(70) + 교과(27) + 출석(10)', 0, 0),
			(81, 'recu_1081', '일괄합산', '', '', '논술(70) + 교과(30)', 0, 0),
			(82, 'recu_1082', '일괄합산', '', '', '논술(80) + 교과(10) + 출결(5) + 봉사(5)', 0, 0),
			(83, 'recu_1083', '일괄합산', '', '', '논술(80) + 교과(20)', 0, 0),
			(84, 'recu_1084', '일괄합산', '', '', '논술(80) + 학생부종합평가(20)', 0, 0),
			(85, 'recu_1085', '일괄합산', '', '', '논술(90) + 교과(10)', 0, 0),
			(86, 'recu_1086', '일괄합산', '', '', '논술고사(60) + 교과(40)', 0, 0),
			(87, 'recu_1087', '일괄합산', '', '', '서류(100)', 0, 0),
			(88, 'recu_1088', '일괄합산', '', '', '서류(50) + 교과(20) + 실기(30)', 0, 0),
			(89, 'recu_1089', '일괄합산', '', '', '서류(70) + 면접(30)', 0, 0),
			(90, 'recu_1090', '일괄합산', '', '', '학생부(100)', 0, 0),
			(91, 'recu_1091', '일괄합산', '', '', '학생부종합평가(100)', 0, 0),
			(92, 'recu_9999', '', '', '', '', 0, 0);
		`)
	
	utils.HandleErr(err, "Insert Data into recruit_method table")
	_, err = stmt.Exec()
	utils.HandleErr(err, "Exec for Insert Data into recruit_method table")
}
